Here is top of the notebook
[Go to the bottom of this notebook](#bottom)
<a id="top"></a>

# This is a heading.

This is a list.

* item a
* item b
* item c

This is inline code `str.contains('x')`

This is a block of code

```python
a = 5
b = 3
if a > b:
    print("True")
```

**bold text**

*italicized text*

> blockquote

# H1
## H2
### H3

### Ordered List

1. First item
2. Second item
3. Third item

### Unordered List

- First item
- Second item
- Third item

### Subscripts

H~2~O

### Superscript

X^2^


### Link

["MNRI"](http://mnri.ch)

### Image

![alter](image.jpg)

### Foot Note

Here's a sentence with a footnote. [^1]

### Straight through

~~The world is flat.~~

### Emoji

That is so funny! :joy:

one camping! :tent: Be back soon.

That is so funny! :joy:

In [11]:
import seaborn as sns
data = sns.load_dataset('titanic')
data.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [12]:
print("Hello")

Hello

In [13]:
x = 1
x

1

In [14]:
y = x*2
y

2

In [16]:
my_list = [1, 2, 3]
my_number = 10

In [18]:
# Use Tab to get variable name and available function

my_list.append(6)
my_list

[1, 2, 3, 6, 6]

here is the end of the notebook
<a id="bottom"></a>
[back to top](#top)

<a id="destination tag"></a>

<a id="destination tag"></a>